Repository: mrachinskiy/booltron
Catalog: source/localization/*.po
Languages: es, fr_fr, it_it, ru_ru

source: Location Offset
es: Desplazar posición
it_it: Offset di Posizione
ru_ru: Сдвиг позиции

source: Keep Objects
es: Conservar objetos
fr_fr: Conserver les objets
it_it: Mantieni Oggetti
ru_ru: Сохранить объекты

source: Destructive
es: Destructivo
fr_fr: Destructif
it_it: Distruttivo
ru_ru: Деструктивные

source: Non-destructive
es: No destructivo
fr_fr: Non-Destructif
it_it: Non Distruttivo
ru_ru: Недеструктивные

source: Primary Object
es: Objeto principal
fr_fr: Élément principal
it_it: Oggetto Primario
ru_ru: Основной объект

source: Secondary Object
es: Objeto secundario
fr_fr: Élément secondaire
it_it: Oggetto Secondario
ru_ru: Вспомогательный объект

source: Pre-processing
es: Preprocesado
fr_fr: Traitement préliminaire
it_it: Pre-elaborazione
ru_ru: Предварительная обработка

source: + New Modifier
es: + Nuevo modificador
fr_fr: + Nouveau Modificateur
it_it: + Nuovo Modificatore
ru_ru: + Новый модификатор

source: Self Intersection
es: Intersección propia
fr_fr: Intersection interne
it_it: Auto-intersezione
ru_ru: Самопересечение

source: Hole Tolerant
es: Tolerancia a huecos
fr_fr: Tolérance aux trous
it_it: Gestione Fori
ru_ru: Устойчивость к отверстиям

source: As Instance
es: Como instancia
fr_fr: En tant qu'instance
it_it: Come Istanza
ru_ru: Как экземпляр

source: Fastest, works only on manifold meshes
es: El más rápido, funciona solo en mallas desplegables
it_it: Più veloce, funziona solo su mesh manifold
ru_ru: Самый быстрый, работает только с развёртываемой геометрией

source: Good performance, doesn't work on coplanar geometry
es: Buen rendimiento, no funciona en geometría coplanar
it_it: Prestazioni buone, non funziona su geometria complanare
ru_ru: Хорошая производительность, не работает с копланарной геометрией

source: Slowest, handles self intersection
es: Más lento, maneja la intersección propia
it_it: Più lento, gestisce l'auto-intersezione
ru_ru: Самый медленный, справляется с самопересечением

source: Default attribute name
it_it: Nome dell'attributo predefinito
ru_ru: Имя атрибута по умолчанию

source: Shift objects location for a very small amount to avoid coplanar geometry errors during boolean operation
es: Cambiar la posición de los objetos una cantidad muy pequeña para evitar errores de geometría coplanar durante la operación booleana
fr_fr: Déplacer légèrement les objets pour éviter les erreurs de géométrie coplanaire pendant les opérations booléennes
it_it: Sposta la posizione degli oggetti di una quantità molto piccola per evitare errori di geometria complanare durante l'operazione booleana
ru_ru: Сдвинуть объекты на небольшое расстояние, чтобы избежать ошибок с копланарной геометрией во время булевой операции

source: Location offset is randomly generated for each object in range [-x, +x] input value
es: El desplazamiento de posición se genera aleatoriamente para cada objeto en el rango [-x, +x] valor de entrada
fr_fr: Le décalage d'emplacement est généré aléatoirement pour chaque objet dans la plage [-x, +x] des valeurs d'entrée
it_it: L'offset di posizione viene generato casualmente per ogni oggetto nell'intervallo [-x, +x] del valore inserito
ru_ru: Сдвиг позиции генерируется в случайном порядке для каждого объекта в диапазоне [-x, +x] указанного значения

source: Get different offset values
es: Obtener diferentes valores de desplazamiento
it_it: Genera valori di offset diversi
ru_ru: Получить другие значения сдвига

source: Displace secondary object to create overlap between slices
es: Desplazar objeto secundario para crear superposición entre cortes
fr_fr: Déplacer l'objet secondaire pour créer une superposition entre les tranches
it_it: Sposta l'oggetto secondario per creare sovrapposizione tra le sezioni
ru_ru: Сместить вспомогательный объект для создания перекрытия между срезами

source: Combine selected objects
es: Combinar objetos seleccionados
fr_fr: Combiner les objets sélectionnés
it_it: Combina gli oggetti selezionati
ru_ru: Объединить выделенные объекты

source: Subtract selected objects from active object
es: Sustraer los objetos seleccionados del objeto activo
fr_fr: Soustraire les objets sélectionnés de l'objet actif
it_it: Sottrae gli oggetti selezionati dall'oggetto attivo
ru_ru: Вычесть выделенные объекты из активного объекта

source: Keep the common part between active and selected objects
es: Conservar la parte común entre los objetos activos y seleccionados
fr_fr: Conserver la partie commune entre les objets actifs et sélectionnés
it_it: Mantiene la parte comune tra oggetto attivo e oggetti selezionati
ru_ru: Оставить общую часть между активным и выделенными объектами

source: Combine active (primary) and selected (secondary) objects
es: Combinar el objeto activo (principal) y los objetos seleccionados (secundarios)
fr_fr: Combiner les objets actifs (primaires) et sélectionnés (secondaires)
it_it: Combina oggetto attivo (primario) e oggetti selezionati (secondari)
ru_ru: Объединить активный (основной) и выделенные (вспомогательные) объекты

source: Subtract selected (secondary) objects from active (primary) object
es: Restar objetos seleccionados (secundarios) del objeto activo (primario)
fr_fr: Soustraire les objets sélectionnés (secondaires) de l'objet actif (primaire)
it_it: Sottrae gli oggetti selezionati (secondari) dall'oggetto attivo (primario)
ru_ru: Вычесть выделенные (вспомогательные) объекты из активного (основного) объекта

source: Keep the common part between active (primary) and selected (secondary) objects
es: Conservar la parte común entre el objeto activo (primario) y objetos seleccionados (secundarios)
fr_fr: Conserver la partie commune entre les objets actifs (primaires) et sélectionnés (secondaires)
it_it: Mantiene la parte comune tra oggetto attivo (primario) e oggetti selezionati (secondari)
ru_ru: Оставить общую часть между активным (основным) и выделенными (вспомогательными) объектами

source: Slice active object along the volume of selected objects
es: Cortar el objeto activo a lo largo del volumen de los objetos seleccionados
fr_fr: Couper l'objet actif le long du volume des objets sélectionnés
it_it: Seziona l'oggetto attivo lungo il volume degli oggetti selezionati
ru_ru: Разрезать активный объект по объёму выделенных объектов

source: Do not remove selected objects after boolean operation (Shortcut: hold Alt when using the tool)
es: No eliminar objetos seleccionados después de la operación booleana (Atajo: mantener la tecla Alt al usar la herramienta)
fr_fr: Ne pas supprimer les objets sélectionnés après l'opération booléenne (Raccourci : maintenez Alt en utilisant l'outil)
it_it: Non rimuove gli oggetti selezionati dopo l'operazione booleana (Scorciatoia: tenere premuto Alt durante l'uso dello strumento)
ru_ru: Не удалять выделенные объекты после булевой операции (Горячая клавиша: удерживайте клавишу Alt при использовании инструмента)

source: Dismiss selected secondary objects from boolean operation
es: Descartar objetos secundarios seleccionados de la operación booleana
fr_fr: Exclure les objets secondaires sélectionnés de l'opération booléenne
it_it: Escludi gli oggetti secondari selezionati dall'operazione booleana
ru_ru: Исключить выделенные вспомогательные объекты из булевой операции

source: Select secondary objects used by given modifier
es: Seleccionar objetos secundarios usados por el modificador dado
fr_fr: Sélectionner les objets secondaires utilisés par le modificateur spécifié
it_it: Seleziona gli oggetti secondari utilizzati dal modificatore indicato
ru_ru: Выделить вспомогательные объекты используемые данным модификатором

source: Disable boolean modifiers on all objects
es: Desactivar modificadores booleanos en todos los objetos
fr_fr: Désactiver les modificateurs booléens sur tous les objets
it_it: Disattiva i modificatori booleani su tutti gli oggetti
ru_ru: Отключить логические модификаторы на всех объектах

source: Bake modifier result for selected objects
es: Capturar resultado del modificador para los objetos seleccionados
fr_fr: Appliquer le résultat du modificateur pour les objets sélectionnés
it_it: Precalcola il risultato del modificatore per oggetti selezionati
ru_ru: Запечь результат модификатора выделенных объектов

source: Bake modifier result
es: Capturar resultado del modificador
fr_fr: Appliquer le résultat du modificateur
it_it: Precalcola il risultato del modificatore
ru_ru: Запечь результат модификатора

source: Delete modifier bake for selected objects
es: Borrar la captura del modificador para los objetos seleccionados
fr_fr: Supprimer l'application du modificateur pour les objets sélectionnés
it_it: Elimina l'applicazione del modificatore per gli oggetti selezionati
ru_ru: Удалить запекание модификатора выделенных объектов

source: Create instance mesh copy of selected objects
es: Crear una copia de malla de instancia de los objetos seleccionados
fr_fr: Créer une copie du maillage des objets sélectionnés
it_it: Crea una copia mesh istanziata degli oggetti selezionati
ru_ru: Создать экземпляр мэш копию выделенных объектов

source: Shortcut: hold Alt when using the tool
es: Atajo: Mantener la tecla Alt mientras se usa la herramienta
fr_fr: Raccourci : maintenez Alt lors de l'utilisation de l'outil
it_it: Scorciatoia: tenere premuto Alt durante l'uso dello strumento
ru_ru: Горячая клавиша: удерживайте клавишу Alt при использовании инструмента

source: Boolean operation result is non-manifold
es: El resultado de la operación booleana no es desplegable
fr_fr: Le résultat de l'opération booléenne est non-manifold
it_it: Il risultato dell'operazione booleana è non-manifold
ru_ru: Результат булевой операции неразвёртываемый

source: Non-manifold input, choose different solver
es: Entrada no desplegable, elegir un solucionador diferente
it_it: Input non-manifold, scegliere un solver diverso
ru_ru: Неразвёртываемая геометрия на вводе, выберите другой решатель

source: Float solver does not support attributes
es: El solucionador decimal no admite atributos
it_it: Il risolutore Float non supporta gli attributi
ru_ru: Нецелый решатель не поддерживает атрибуты

source: At least two objects must be selected
es: Se deben seleccionar al menos dos objetos
fr_fr: Au moins deux objets doivent être sélectionnés
it_it: Devono essere selezionati almeno due oggetti
ru_ru: Как минимум два объекта должны быть выделены

source: Object does not have Booltron modifiers
es: El objeto no tiene modificadores Booltron
fr_fr: L'objet n'a pas de modificateurs Booltron
it_it: L'oggetto non ha modificatori Booltron
ru_ru: Объект не имеет модификаторов Booltron

source: File not saved
es: Archivo no guardado
fr_fr: Fichier non sauvegardé
it_it: File non salvato
ru_ru: Файл не сохранён

# Operator
source: Union
es: Unión
it_it: Unione
ru_ru: Объединение

# Operator
source: Difference
es: Diferencia
fr_fr: Différence
it_it: Differenza
ru_ru: Разность

# Operator
source: Intersect
es: Intersección
fr_fr: Intersection
it_it: Intersezione
ru_ru: Пересечение

# Operator
source: Slice
es: Cortar
fr_fr: Coupe
it_it: Seziona
ru_ru: Разрезать

# Operator
source: Dismiss
es: Descartar
fr_fr: Rejeter
it_it: Escludi
ru_ru: Исключить

# Operator
source: Bake Modifier
es: Modificador de captura
fr_fr: Appliquer un modificateur
it_it: Precalcolo Modificatore
ru_ru: Запечь модификатор

# Operator
source: Delete Bake
es: Borrar captura
it_it: Elimina Precalcolo
ru_ru: Удалить запекание

# Operator
source: Instance Copy
es: Copia de instancia
fr_fr: Copie d'instance
it_it: Copia di Istanza
ru_ru: Экземпляр копия
